tap "homebrew/bundle"
# Good for updating casks
tap "buo/cask-upgrade"
# print contents of files
brew "bat"
# aws cli
brew "awscli"
# Distributed revision control system
brew "git"
# UNIX shell (command interpreter)
brew "zsh"
# Python code formatter
brew "black"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Commit formatting tool
brew "commitizen"
# Promt to store GPG key passphrases into keychain
brew "pinentry-mac"
# Needed to build python
brew "openssl"
# Needed to build python
brew "readline"
# Needed to build python
brew "sqlite3"
# Needed to build python
brew "xz"
# Needed to build python
brew "zlib"
# cmake
brew "cmake"
# Mac App store CLI
brew "mas"
# file sending
brew "croc"
# Image handling
brew "ffmpeg"
# pulumi
brew "pulumi"
# Java runtime
brew "java"
# Unknown but needed
brew "jq"
# Install github-cli
brew "gh"
# Utility to programmatically access the clipboard
brew "xclip"
# Investigate disk usage
brew "ncdu"
# # Used to search and push to balena devices, ignored deps because it has a dependecy on node
# brew "balena-cli", args: ["ignore-dependencies"]
# # PNPM Dependency
# brew "corepack", args: ["ignore-dependencies"]
# # PNPM - faster npm
# brew "pnpm"
# Ability to access clipboard with commad=nd shift V
cask "flycut"
# To be able to install an openapi version
cask "google-chrome"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Postman
cask "postman"
# Git GUI client
cask "gitkraken"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for GitHub repositories
cask "github"
# Command pannel
cask "raycast"
# Messaging Platform
cask "whatsapp"
# Password Manager
cask "1password"
# Ticketing Platform
cask "linear-linear"
# Video Conferencing
cask "zoom"
# Containerisation
cask "docker"
# etcher
cask "balenaetcher"
# gather
cask "gather"
# browser
cask "arc"
# Claude Desktop AI assistant
cask "claude"
# tool to access databases
cask "tailscale"
# Inspect databases
cask "pgadmin4"
# Flash card program
cask "anki"