tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# aws cli
brew "awscli"
# Distributed revision control system
brew "git"
# UNIX shell (command interpreter)
brew "zsh"
# Python code formatter
brew "black"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Promt to store GPG key passphrases into keychain
brew "pinentry-mac"
# Needed to build python
brew "openssl"
# Needed to build python
brew "readline"
# Needed to build python
brew "sqlite3"
# Needed to build python
brew "xz"
# Needed to build python
brew "zlib"
# cmake
brew "cmake"
# Mac App store CLI
brew "mas"
# file sending
brew "croc"
# pulumi
brew "pulumi"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for GitHub repositories
cask "github"
# Command pannel
cask "raycast"
# Messaging Platform
cask "whatsapp"
# Password Manager
cask "1password"
# Ticketing Platform
cask "linear-linear"
# Video Conferencing
cask "zoom"
# Containerisation
cask "docker"
# etcher
cask "balenaetcher"
# gather
cask "gather"